export default {
  title: `FWF 工作室纳新`,
  intro: `#### Why FWF？
FWF 是一个专注于web技术的工作室( 非院校社团 ) ，致力于打造良好的技术交流氛围。

在这里，你可以与志同道合的人一起学习技术、开发项目、获得提升。

FWF 是一个初步成立的大学生工作室，我们有着很好的项目点子等着你实现，我们期待你的加入。`,
  internship: `##### 实习成员纳新


  **1、面向对象**

  ​	大一在校学生

  **2、纳新方向及要求**

  - 前端（招收10人）

    - 对技术有着强烈的热爱，有上进心与责任心，有着强烈的竞争意识。有前端技术基础者优先

  - 后端（招收15人）

    - 热爱后端技术，有后端开发经验者优先

  - 移动端（招收5人）

    - 有一定的编程经验。有前端开发经验或者Dart语言基础亦或Flutter开发经验者优先

  **3、关于组织**

   **没基础？没接触过编程？**

   **没关系，只要你热爱技术、自律并愿意为技术付出时间，我们欢迎你 ~**

  ​	**成为实习成员前，会有两周时间自由学习，随后进行简单面试，主要考察自学能力和主观能动性，让我们看到你的潜力！**

  ​	**通过面试后，有三个月时间跟随FWF前辈学习相关方向的技术。三个月后进行转正考核**

  ​	前端目标转正人数：3人

  ​	后端目标转正人数：5人

  ​	移动端目标转正人数：2人

  **最终转正人数会根据实际招收人数有所调整**

  <br>

  ##### 心动了？如何成为FWF实习成员？`,
  regular: `
  ##### 正式成员纳新

  **1、面向对象**

  ​    大一、大二在校学生，拥有一定的技术基础

  **2、纳新方向及要求**

  - 前端（招收2~3人）

    - 掌握HTML, CSS, JavaScript

    - 了解JavaScript基础，如闭包, 作用域, 原型链等，对ES6及以上规范有一定的学习

    - 接触过 ajax / axios / fetch

    - 有 jQuery 使用经验

    - 有 Vue / React 的开发经验

    - 有一定计算机网络基础

      - 加分项：
          1. 了解npm, webpack项目构建工具

          2. 熟练使用Git，以及在Github上有过提交记录

          3. 有完整的开发项目

          4. 有TypeScript相关使用经验

          5. 有Node使用经验

  - 后端

    - JAVA后端（招收3~4人）

      - 掌握Java语言，能够正确运用Java API，有良好的编程习惯，代码有较强的可读性

      - 了解HTTP, TCP/IP协议栈基本内容

      - 掌握基本的数据库设计方法，包括E-R图，关系模式，范式及规范化分析以及基本的SQL语句

      - 熟悉ssm开源框架

      - 对Linux操作系统有一定的学习

      - 熟练使用Git

        - 加分项：
            1. 对SpringBoot有一定的了解

            2. 有自己的独立开发项目

            3. 了解JVM，JMM，JUC并发原理

            4. 会通过explain查看索引执行计划，并进行索引优化

            5. 了解基本的数据结构与算法。

    - Node后端（招收1~3人）

      - 掌握JavaScript基础，如闭包, 作用域, 原型链等，对ES6以上规范有一定的学习

      - 了解CommonJS、ES6 import等模块规范

      - 了解HTTP, TCP/IP协议

      - 熟练使用mangoDB 或 MySQL

      - 掌握 Express / Koa2 / Egg

        - 加分项：
            1. 有完整的开发项目

            2. 有过前后端分离的开发经验

            3. 熟练使用Git

            4. Node项目服务器部署经验

  - 移动端（招收3人）

    - 熟练使用 Flutter / React Native

      - 加分项
          1. 有前端开发经验

          2. 熟悉PWA技术

  <br>

  ##### 加入我们？`
};
